
&НаКлиенте
Процедура КомандаИнтерфейсАвто(Команда)
	ИзменитьНаСервере(ВариантМасштабаФормКлиентскогоПриложения.Авто);
	//ЗавершитьРаботуСистемы(Истина, Истина, "");	
	Сообщить("Режим изменен, перезапустите 1С, убедившись что все данные записаны.");
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнтерфейсКомпактный(Команда)
	ИзменитьНаСервере(ВариантМасштабаФормКлиентскогоПриложения.Компактный);
	//ЗавершитьРаботуСистемы(Истина, Истина, "");	
	Сообщить("Режим изменен, перезапустите 1С, убедившись что все данные записаны.");
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнтерфейсОбычный(Команда)
	ИзменитьНаСервере(ВариантМасштабаФормКлиентскогоПриложения.Обычный);	
	//ЗавершитьРаботуСистемы(Истина, Истина, "");	
	Сообщить("Режим изменен, перезапустите 1С, убедившись что все данные записаны.");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
	Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
		Настройка = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;
	ТекущееСостояниеИнтерфейса = Настройка.ВариантМасштабаФормКлиентскогоПриложения;
		
	Если Настройка.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		ЭтаФорма.Элементы.ДекорацияТекущееСостояние.Заголовок = "Текущая настройка интерфейса - "+ТекущееСостояниеИнтерфейса;
		Если ТекущееСостояниеИнтерфейса = ВариантМасштабаФормКлиентскогоПриложения.Обычный Тогда
			ЭтаФорма.Элементы.КомандаИнтерфейсОбычный.Видимость = Ложь;
		ИначеЕсли ТекущееСостояниеИнтерфейса = ВариантМасштабаФормКлиентскогоПриложения.Компактный Тогда
			ЭтаФорма.Элементы.КомандаИнтерфейсКомпактный.Видимость = Ложь;
		Иначе 
			ЭтаФорма.Элементы.КомандаИнтерфейсАвто.Видимость = Ложь;
		КонецЕсли;
	Иначе   //Формы - не такси, смысла не имеет  
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСервере(НовоеСостояниеИнтерфейса)
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
	Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
		Настройка = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;
	Настройка.ВариантМасштабаФормКлиентскогоПриложения = НовоеСостояниеИнтерфейса;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройка,, Пользователь.Имя);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
