Процедура КоманднаяПанельСпискаКнопкаДобавить(Кнопка)
	
	//добавлять будем через апи или фтп
	
	
	ФормаЭлемента = ПолучитьФорму("НашиОрганизации_Элемент");
	ФормаЭлемента.Открыть();
	
КонецПроцедуры

Процедура ОбновитьСписокСправочника()
	
	//УчетнаяЗаписьПоУмолчанию = ПолучитьКонстантуEDI("УчетнаяЗаписьПоУмолчанию");
	
	СправочникСписок.Очистить();
	
	СписокЭлементов = ПолучитьСписокЭлементовСправочника("НашиОрганизации");
		
	Для каждого Стр ИЗ СписокЭлементов Цикл
			
		НоваяСтрока = СправочникСписок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПриОткрытииФормы(ЭтаФорма);
	
	ОбновитьСписокСправочника();
	
	Если РежимВыбораСписка Тогда
		
		КнопкиСписка = ЭлементыФормы.КоманднаяПанельСписка.Кнопки;
	
		ДействиеКнопки = Новый Действие("КнопкаВыбратьЭлементНажатие");
		
		КоличествоКнопокДо = КнопкиСписка.Количество();
		
		НоваяКнопка = КнопкиСписка.Добавить("Выбрать",ТипКнопкиКоманднойПанели.Действие,"Выбрать", ДействиеКнопки);
		НоваяКнопка.Картинка	= ЭлементыФормы.КартинкаВыбор.Картинка;
		НоваяКнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
		
		Для н = 1 по КоличествоКнопокДо Цикл
		
			КнопкиСписка.Сдвинуть(КнопкиСписка[0],КоличествоКнопокДо);

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаВыбратьЭлементНажатие(Элемент)
	
	ВыбратьЭлементСписка();
	
КонецПроцедуры

Процедура ВыбратьЭлементСписка()
	
		ТекСтрока = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
		
		Если НЕ ТекСтрока = Неопределено Тогда
			
			СсылкаВыбора = ТекСтрока.Ссылка;
			
			ЭтаФорма.Закрыть(Истина);
			
		КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуЭлемента()
	
	ТекСтрока = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
	
		ФормаЭлемента = ПолучитьФорму("НашиОрганизации_Элемент",ЭтаФорма);
		ФормаЭлемента.Ссылка = ТекСтрока.Ссылка;
		ФормаЭлемента.Открыть();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимВыбораСписка Тогда
		
		ВыбратьЭлементСписка();

	Иначе
		
		ОткрытьФормуЭлемента();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурEDI_ОбновитьСписок_НашиОрганизации" Тогда
		
		ОбновитьСписокСправочника();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельСпискаКнопкаОткрыть(Кнопка)

	ОткрытьФормуЭлемента();
	
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	//Если ДанныеСтроки.Основная Тогда
	//	ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,,Истина);
	//КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	
	//Если НЕ ТекСтрока = Неопределено Тогда
	//	
	//	Если ТекСтрока.Основная Тогда
	//		ЭлементыФормы.КоманднаяПанельСписка.Кнопки.КнопкаУстановитьОсновной.Доступность = Ложь;
	//	Иначе
	//		ЭлементыФормы.КоманднаяПанельСписка.Кнопки.КнопкаУстановитьОсновной.Доступность = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
		
КонецПроцедуры

Процедура КоманднаяПанельСпискаОбновитьССервера(Кнопка)
	
	Если ПротоколОбмена_КонтурEDI <> "API" Тогда
		ВывестиПредупреждение_КонтурEDI("Только для API");
		//убрать видимость кнопки
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокОрганизацийПоУчетнымЗаписям();
	ОбновитьСписокСправочника();
	
КонецПроцедуры


