&НаСервере
Перем ОбработкаОбъект;

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
		
		//Если Параметры.АдресХранилища<>"" Тогда
		//	ОбработкаОбъект = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
		//	Возврат ОбработкаОбъект;
		//КонецЕсли;
		//
		//Если ОбработкаОбъект=Неопределено Тогда
		//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		//	ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
		//КонецЕсли;
		//
		//Параметры.АдресХранилища = ПоместитьВоВременноеХранилище(ОбработкаОбъект,УникальныйИдентификатор);
	
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.МодальностьЗапрещена = МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	
	URL = Параметры.URL;
	Если URL = "" Тогда
		URL = "https://edi.kontur.ru/1c/history.html";
		КодРаздела = "ПоказатьОбновления_НомерРелиза";
		Элементы.ФормаНеПоказыватьБольше.Заголовок = "Не показывать до следующего релиза";
	Иначе
		Заголовок = "Обучение";
	КонецЕсли;
	
	HTMLТекст = URL;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьБольше(Команда)
	//Если КодРаздела="ПоказатьОбновления_НомерРелиза" Тогда
		НеПоказыватьБольшеСервер();
	//Иначе
	//	КонтурEDI_НеПоказыватьСправку=Истина);
	//КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("КонтурEDI_ЗакрытаФормаСправки");
КонецПроцедуры

&НаСервере
Процедура НеПоказыватьБольшеСервер()

	МодульОбъекта().УстановитьКонстантуEDI("ПоказатьОбновления_НомерРелиза",МодульОбъекта().ПолучитьНомерРелиза_КонтурEDI());

КонецПроцедуры // НеПоказыватьБольше()
