Перем ИмяВыбраннойКонфигурации;

Процедура КнопкаВыполнитьНажатие(Кнопка)

	Если ЗначениеЗаполнено(ИмяВыбраннойКонфигурации) Тогда
		ИмяКонфигурации1С = ИмяВыбраннойКонфигурации;
		УстановитьГлобальноеСвойство("ИмяКонфигурации1С",ИмяВыбраннойКонфигурации);
	КонецЕсли;	
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПриОткрытииФормы(ЭтаФорма);
	
	ТекстОшибки = 
		"Данный модуль для вашей конфигурации не поддерживается!
		|
		|Он работает только в следующих конфигурациях:
		|
		|	- Управление торговлей, ред. 10.2
		|	- Управление торговлей, ред. 10.3
		|	- Бухгалтерия предприятия, ред. 2.0
		|	- Комплексная автоматизация, ред. 1.1
		|	- Управление производственным предприятием, ред. 1.2
		|	- Управление производственным предприятием, ред. 1.3
		|	- 1C:Хлебобулочное и кондитерское производство (Управление сбытом продукции), ред. 1.3
		|	- Рарус: ТКПТ
		|	- Управление птицефабрикой, редакция 1.3
		|	- ДАЛИОН: Управление магазином, ред. 1.2
		|	- Трактиръ: Head-Office БИЗНЕС, ред. 1.0
		|	- АСТОР: Торговый дом 7";
	
КонецПроцедуры

Процедура ПредставлениеВыбраннойКонфигурацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	
	СписокВыбора.Добавить("УТ_10_3","Управление торговлей, ред. 10.3");
	СписокВыбора.Добавить("УТ_10_2","Управление торговлей, ред. 10.2");
	СписокВыбора.Добавить("БП",		"Бухгалтерия предприятия, ред. 2.0");
	СписокВыбора.Добавить("УПП",	"Управление производственным предприятием, ред. 1.3");
	СписокВыбора.Добавить("КА",		"Комплексная автоматизация, ред. 1.1");
	СписокВыбора.Добавить("ТКПТ",	"1С-Рарус: Торговый комплекс. Производственные товары, ред. 10.3");
	СписокВыбора.Добавить("АСТОР",	"Астор: Торговый дом 7.0");
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора,Элемент);
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		ИмяВыбраннойКонфигурации = ВыбранноеЗначение.Значение;
		ПредставлениеВыбраннойКонфигурации = ВыбранноеЗначение.Представление;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПредставлениеВыбраннойКонфигурацииОчистка(Элемент, СтандартнаяОбработка)
	
	ИмяВыбраннойКонфигурации = "";
	
КонецПроцедуры
