Процедура УстановитьТипПоля1С(ИмяНаФорме,Тип1С)
	
	ПолеФормы	= ЭлементыФормы[ИмяНаФорме];
	ТипПоля		= ПолучитьТипЗначенияОбъекта(Тип1С);
			
	Если ТипПоля = Неопределено Тогда
		
		Сообщить("Не задан тип объекта 1С для поля с типом "+Тип1С);
		
	Иначе	
		
		ЭлементыФормы[ИмяНаФорме].ОграничениеТипа = Новый ОписаниеТипов(ТипПоля);
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[ИмяНаФорме]) Тогда
			
			ЭтаФорма[ИмяНаФорме] = ПолучитьПустуюСсылкуОбъекта(Тип1С);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)

	Если НЕ ПроверитьЗначенияФормы() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПолей = СоздатьСтруктуруСправочникаДляСохранения();

	СохранитьЭлементСправочника("НашиОрганизации", Ссылка, СтруктураПолей);
	
	Оповестить("КонтурEDI_ОбновитьСписок_НашиОрганизации");
		
	Соединение = Неопределено;//???
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПриОткрытииФормы(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтруктураПолей = ПолучитьЭлементСправочника("НашиОрганизации", Ссылка);
		УчетнаяЗаписьПредставление = ПолучитьПредставлениеЭлементаСправочника(УчетнаяЗапись);
		
		Если СтруктураПолей <> Неопределено Тогда
		
			partyId 		= СтруктураПолей.partyId;
			Наименование 	= СтруктураПолей.Наименование;
			GLN 			= СтруктураПолей.GLN;
			УчетнаяЗапись 	= СтруктураПолей.УчетнаяЗапись;
			ОсновнойЯщик 	= СтруктураПолей.ОсновнойЯщик;
			Неактивная		= СтруктураПолей.Неактивная;
			УчетнаяЗаписьПредставление = ПолучитьПредставлениеЭлементаСправочника(УчетнаяЗапись);
			
			//показать транспортные ящики
			ОбновитьСписокТранспортныхЯщиков();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Оповестить("КонтурEDI_АктивизироватьФормуОшибок","Открытие",ЭтаФорма);

КонецПроцедуры

Функция ПроверитьЗначенияФормы()
	
	// 1. инициализируем таблицу вывода ошибок
	ТаблицаОшибок = ИнициализироватьТаблицуОшибок();
	
	// 2. передать структуру для проверки
	//ПроверитьПолеФормы(ТаблицаОшибок, Логин,	"Строка50", Истина, "Логин");
	//ПроверитьПолеФормы(ТаблицаОшибок, Пароль, 	"Строка50",	Истина, "Пароль");
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		
		//Если ПустаяСтрока(Логин) Тогда
		//	
		//	ТекстЗаголовка = "При заполнении учетной записи найдены ошибки.";
		//	
		//Иначе
		//	
		//	ТекстЗаголовка = "При заполнении учетной записи """+СокрЛП(Логин)+""" найдены ошибки.";
		//	
		//КонецЕсли;
		//	
		//ОткрытьФормуВыводаОшибок(ТекстЗаголовка,ТаблицаОшибок,ЭтаФорма);
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Процедура ПриЗакрытии()
	
	Оповестить("КонтурEDI_АктивизироватьФормуОшибок","Закрытие",ЭтаФорма);

КонецПроцедуры

Функция  СоздатьСтруктуруСправочникаДляСохранения()
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("partyId", 									partyId);
	СтруктураПолей.Вставить("Наименование", 							Наименование);
	СтруктураПолей.Вставить("GLN", 										GLN);
	СтруктураПолей.Вставить("УчетнаяЗапись",							УчетнаяЗапись);
	СтруктураПолей.Вставить("ОсновнойЯщик",								ОсновнойЯщик);
	СтруктураПолей.Вставить("Неактивная",								Неактивная);
	Возврат СтруктураПолей;
КонецФункции	

Процедура УчетнаяЗаписьПредставлениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	ВыбратьЭлементСправочника(УчетнаяЗапись,"УчетнаяЗапись",,СтандартнаяОбработка);
	УчетнаяЗаписьПредставление = ПолучитьПредставлениеЭлементаСправочника(УчетнаяЗапись);
КонецПроцедуры


Процедура ОбновитьСписокТранспортныхЯщиков()
	СписокЯщиков = ПолучитьСписокЭлементовСправочника("ТранспортныеЯщики",Ссылка);
	ТранспортныеЯщики.Очистить();
	Для Каждого СтрокаЯщиков Из СписокЯщиков Цикл
		НовСтрока = ТранспортныеЯщики.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаЯщиков);
	КонецЦикла;	
КонецПроцедуры	

Процедура ТранспортныеЯщикиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено Тогда
		ОткрытьФормуЭлементаСправочника("ТранспортныеЯщики",ВыбраннаяСтрока.Ссылка);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурEDI_ОбновитьСписок_ТранспортныеЯщики" Тогда
		
		ОбновитьСписокТранспортныхЯщиков();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура КоманднаяПанельСпискаЯщиковУстановитьОсновным(Кнопка)
	ТекСтрока = ЭлементыФормы.ТранспортныеЯщики.ТекущаяСтрока;
	Если ТекСтрока<>Неопределено Тогда
		ОсновнойЯщик = ТекСтрока.Ссылка;
		ЭлементыФормы.ТранспортныеЯщики.ОбновитьСтроки();
	КонецЕсли;	
КонецПроцедуры


Процедура ТранспортныеЯщикиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Ссылка = ОсновнойЯщик Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,,Истина);
	КонецЕсли;
КонецПроцедуры

