Процедура ПриОткрытии()
	
	Если URL = "" Тогда
		URL = "https://edi.kontur.ru/1c/history.html";
		КодРаздела = "ПоказатьОбновления_НомерРелиза";
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.НеПоказыватьБольше.Текст = "Не показывать до следующего релиза";
	Иначе
		Заголовок = "Обучение";
	КонецЕсли;
	
	ПриОткрытииФормы(ЭтаФорма);
	
	ЭлементыФормы.ПолеHTMLДокумента.Перейти(URL);
		
КонецПроцедуры

Процедура ОсновныеДействияФормыНеПоказыватьБольше(Кнопка)
	Если КодРаздела="ПоказатьОбновления_НомерРелиза" Тогда
		СохранитьЗначение("ПоказатьОбновления_НомерРелиза",ПолучитьНомерРелиза_КонтурEDI());
	Иначе
		СохранитьЗначение("КонтурEDI_НеПоказыватьСправку_"+КодРаздела,Истина);
	КонецЕсли;
	Закрыть();
КонецПроцедуры


Процедура ПриЗакрытии()
	Оповестить("КонтурEDI_ЗакрытаФормаСправки");
КонецПроцедуры

