&НаСервере
Перем ОбработкаОбъект;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ИнтервалАвтообмена=0 Тогда ИнтервалАвтообмена=300; КонецЕсли; //3 минуты
	ПодключитьОбработчикОжидания("ВыполнитьФоновыйОбмен",1,Истина); //первый автообмен сразу
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФоновыйОбмен()
	Элементы.Состояние.Заголовок="Фоновый обмен исполняется";
	
	ВыполнитьОбменСервер();
	
	ПодключитьОбработчикОжидания("ВыполнитьФоновыйОбмен",ИнтервалАвтообмена,Истина);
	Элементы.ПоследнийРазИсполнен.Заголовок="Фоновый обмен последний раз исполнен: "+Формат(ТекущаяДата(),"ДЛФ=T");
	Элементы.Состояние.Заголовок="Фоновый обмен будет запущен в: "+Формат(ТекущаяДата()+ИнтервалАвтообмена,"ДЛФ=T");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменСервер()
	МодульОбъекта().ВыполнитьОбменССервером();
КонецПроцедуры

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
	
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьАвтообмен(Команда)
ВернутьДоступностьКнопкиВыполнитьОбменРодительскойФормы();
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалАвтообменаПриИзменении(Элемент)
	МинимальныйИнтервалСрабатываения = 300;
	Если ИнтервалАвтообмена<МинимальныйИнтервалСрабатываения Тогда 
		 ИнтервалАвтообмена=МинимальныйИнтервалСрабатываения;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ВыполнитьФоновыйОбмен");
	ПодключитьОбработчикОжидания("ВыполнитьФоновыйОбмен",ИнтервалАвтообмена,Истина);
	
	Элементы.Состояние.Заголовок="Фоновый обмен будет запущен в: "+Формат(ТекущаяДата()+ИнтервалАвтообмена,"ДЛФ=T");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ВернутьДоступностьКнопкиВыполнитьОбменРодительскойФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьДоступностьКнопкиВыполнитьОбменРодительскойФормы()
	Попытка
		ЭтаФорма.ВладелецФормы.Элементы.ВыполнитьОбмен.Доступность=истина;
		ЭтаФорма.ВладелецФормы.Элементы.ВыполнитьОбмен.Заголовок="Обмен с сервером";
	Исключение
		//основной модуль уже закрыли, ну и ок
	КонецПопытки;
КонецПроцедуры

