
Процедура ОсновныеДействияФормыПометитьСчетаФактурыКакНеподписанные(Кнопка)

	ТаблицаДокументов = ТаблицаСФ.Скопировать(,"Документ");
	ТаблицаДокументов.Свернуть("Документ");
	
	Для каждого Стр ИЗ ТаблицаДокументов Цикл
		Сообщение = ПрочитатьСообщение(,Стр.Документ,"INVOIC","Исходящее");
		УдалитьСообщение(Сообщение);
		УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "boxId");
		УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "invoiceId");
		УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "messageId");
		УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "torg12Id");
	КонецЦикла;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

Процедура ТаблицаСФВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Колонка.Имя = "Документ" Тогда
		ВыбраннаяСтрока.Документ.ПолучитьФорму().Открыть();
	Иначе
		ВывестиПредупреждение_КонтурEDI(ВыбраннаяСтрока[Колонка.Имя]);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

