
Процедура ПриОткрытии()
	
	ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

Процедура ТабСетейПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Кнопка.Гиперссылка = Истина;
	ОформлениеСтроки.Ячейки.ТорговаяСеть.УстановитьКартинку(ЭлементыФормы.КартинкаОнлайн.Картинка);
	
КонецПроцедуры

Процедура ТаблицаСетейВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.СсылкаНаСайте) Тогда
		ТекСсылка = "http://www.r-kontur.ru/clients/"+СокрЛП(ВыбраннаяСтрока.СсылкаНаСайте);
	Иначе
		ТекСсылка = "http://www.r-kontur.ru/price";
	КонецЕсли;
	
	ТекСсылка = ТекСсылка + "?GLN="+СокрЛП(ОсновнойGLN);
	
	ЗапуститьПриложение(ТекСсылка);
	
КонецПроцедуры


Процедура КнопкаЗакрытьНажатие(Элемент)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


Процедура ПриЗакрытии()
	
	Если НеНапоминатьМесяц Тогда
		СохранитьЗначение("КонтурEDI_ДатаПредложенияПодключенияТС",ДобавитьМесяц(ТекущаяДата(),1));
	Иначе
		СохранитьЗначение("КонтурEDI_ДатаПредложенияПодключенияТС",ТекущаяДата());
	КонецЕсли;
		
КонецПроцедуры

