
//Скопирована из стандартной

Процедура ПриОткрытии()
	
	ЭлементыФормы.ПолеТабличногоДокумента.ВставитьОбласть(ПечатныйДокумент.Область());
	
	ЭлементыФормы.ПолеТабличногоДокумента.ОтображатьЗаголовки = Ложь;
	ЭлементыФормы.ПолеТабличногоДокумента.ОтображатьСетку     = Ложь;
	ЭлементыФормы.ПолеТабличногоДокумента.Защита              = Защита;
	ЭлементыФормы.ПолеТабличногоДокумента.ТолькоПросмотр      = Истина;
	ЭлементыФормы.ПолеТабличногоДокумента.ИмяПараметровПечати = ПечатныйДокумент.ИмяПараметровПечати;
	ЭлементыФормы.ПолеТабличногоДокумента.ПовторятьПриПечатиСтроки = ПечатныйДокумент.ПовторятьПриПечатиСтроки;
	
КонецПроцедуры

Процедура КоманднаяПанельФормыОтправитьПоПочте(Кнопка)
	Если Метаданные.ОбщиеМодули.Найти("УправлениеОтчетами") <> неопределено тогда
		Выполнить("УправлениеОтчетами.ОтправитьДокументПоЭлектроннойПочте(ЭлементыФормы.ПолеТабличногоДокумента, Заголовок);");
	иначе
	Сообщить("Не поддерживается текущей версией конфигурации");
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельФормыНаПринтер(Кнопка)
	Если КонтурEDI_ВерсияПлатформы()= "81" Тогда
		Выполнить("ПечатныйДокумент.Напечатать(Ложь)");													//вариант для 8.1
	Иначе
		Выполнить("ПечатныйДокумент.Напечатать(РежимИспользованияДиалогаПечати.Использовать)");			//вариант для 8.2
	КонецЕсли;	
КонецПроцедуры


ПечатныйДокумент = Новый ТабличныйДокумент;

