&НаСервере
Перем ОбработкаОбъект;

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
		
		//Если Параметры.АдресХранилища<>"" Тогда
		//	ОбработкаОбъект = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
		//	Возврат ОбработкаОбъект;
		//КонецЕсли;
		//
		//Если ОбработкаОбъект=Неопределено Тогда
		//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		//	ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
		//КонецЕсли;
		//
		//Параметры.АдресХранилища = ПоместитьВоВременноеХранилище(ОбработкаОбъект,УникальныйИдентификатор);
	
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ПометитьСчетаФактурыКакНеподписанные(Команда)
	ПометитьСчетаФактурыКакНеподписанныеСервер();	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПометитьСчетаФактурыКакНеподписанныеСервер()

	_ТаблицаСФ=РеквизитФормыВЗначение("ТаблицаСФ");
	
	ТаблицаДокументов = _ТаблицаСФ.Скопировать(,"Документ");
	ТаблицаДокументов.Свернуть("Документ");
	
	Для каждого Стр ИЗ ТаблицаДокументов Цикл
		Сообщение = МодульОбъекта().ПрочитатьСообщение(,Стр.Документ,"INVOIC","Исходящее");
		МодульОбъекта().УдалитьСообщение(Сообщение,Стр.Документ);
		МодульОбъекта().УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "boxId");
		МодульОбъекта().УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "invoiceId");
		МодульОбъекта().УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "messageId");
		МодульОбъекта().УдалитьЗначениеСвойстваОбъекта(Стр.Документ, "torg12Id");
	КонецЦикла;
	
КонецПроцедуры // ПометитьСчетаФактурыКакНеподписанные()


&НаКлиенте
Процедура ТаблицаСФВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя = "ТаблицаСФДокумент" Тогда
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьЗначение(Элемент.ТекущиеДанные.Документ)");
		Иначе
			ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
		КонецЕсли;
	Иначе
		ТекстПредупреждения=""+Элемент.ТекущиеДанные.Статус + Символы.ПС +Элемент.ТекущиеДанные.Комментарий;
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""EDI.Контур"")");
		Иначе
			Предупреждение(ТекстПредупреждения,,"EDI.Контур");
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого СтрокаУточнения Из Параметры.МассивДокументовСУточнениями Цикл
		НоваяСтрока = ТаблицаСФ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаУточнения);
	КонецЦикла;
КонецПроцедуры
