&НаСервере
Перем ОбработкаОбъект;


//инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
		ОбработкаОбъект.IDОсновнойФормы = Параметры.IDОсновнойФормы;
		
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	ОчиститьСообщения();
	Успешно=Ложь;
	ФайлОтправкиДвДанн = Новый ДвоичныеДанные(ИмяФайла);	
	ВыполнитьОтправкуСервер(ФайлОтправкиДвДанн,GLN,Успешно);
	Если Успешно Тогда 
		//УдалитьФайл
		Сообщить("Отправлено");
		УдалитьФайлы(ИмяФайла); 
	Иначе
		Сообщить("Ошибка отправки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтправкуСервер(ФайлОтправкиДвДанн,GLN,Успешно)

	ИмяВременного=ПолучитьИмяВременногоФайла("xlm");
	ФайлОтправкиДвДанн.Записать(ИмяВременного);
	
	Результат = МодульОбъекта().ПередатьСообщениеНаСервер(Новый Структура("ПутьКФайлу,GLN,Успешно",ИмяВременного,GLN,Истина));
	
	Если Результат.Успешно Тогда
		Успешно=Истина;
	ИНаче
		Успешно=Ложь;
	КонецЕсли;

КонецПроцедуры // ВыполнитьОтправку()

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "XML|*.XML";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСерверебезКонтекста
Функция ПолучитьСписокGLNДляОтправкиСообщения()
	
	Результат = Новый СписокЗначений;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтурEDI_ДополнительныеРеквизиты.Значение КАК GLN
	|ИЗ
	|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	|ГДЕ
	|	(КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_Основной""
	|			ИЛИ КонтурEDI_ДополнительныеРеквизиты.Свойство = ""GLN_Организации"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	GLN";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.GLN);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура GLNНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	СписокКнопок=ПолучитьСписокGLNДляОтправкиСообщения();
	Если Параметры.МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьВыборИзСписка(Новый ОписаниеОповещения(""ОбработчикВыбораДействияИзМенюЕще"",ЭтаФорма), СписокКнопок)");
	Иначе
		ВыбранноеЗначение=ВыбратьИзМеню(СписокКнопок,Элемент);
		ОбработчикВыбораДействияИзМенюЕще(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораДействияИзМенюЕще(ВыбранноеЗначение=неопределено,ДополнительныеПараметры=неопределено)Экспорт
	
	Если ВыбранноеЗначение<>Неопределено Тогда
		GLN = ВыбранноеЗначение.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.МодальностьЗапрещена=МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
    Параметры.КэшироватьМодульОбъекта	= (МодульОбъекта().ПолучитьКонстантуEDI("КэшироватьМодульОбъекта")=Истина);//определение кеширования доступно только после проверки метаданных

КонецПроцедуры


